# 23 - Seleksi Baris pada Data Frame dengan menggunakan `query()`

## Import Modules

### Module yang digunakan :
1. pandas

In [9]:
import pandas as pd

- Mengecheck versi dari module yang digunakan yaitu pandas

In [10]:
print(pd.__version__)

1.0.5

## Membuat Sebuah Data Frame

- Membuat sebuah dictionary *d* yang terdiri dari keys (*kolom_satu* dan *kolom dua*) yang akan menjadi nama kolom. *kolom_satu* akan berisi data *1, 2, 3, 4, 5* dan *kolom dua* akan berisi data *10, 20, 30, 40, 50*.
- Membentuk sebuah data frame *df* yang berisikan data dari dictionary *d* dengan memanggil `pd.DataFrame(d)`.

In [6]:
d = {'kolom_satu':[1, 2, 3, 4, 5], 
     'kolom dua':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

## Seleksi Baris dengan menggunakan `query()`

Penggunaan `query()` disertai oleh query statement dalam bentuk string (diapit oleh penanda string) dan memiliki 2 komponen utama yaitu *nama kolom* dan *kondisi* yang diinginkan.

- Memanggil `df.query()` untuk `kolom_satu` dan kondisi *lebih besar dari 2* (`> 2`)

In [11]:
df.query('kolom_satu > 2')

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

- Memanggil `df.query()` untuk `kolom dua` dan kondisi *lebih besar dari 30* (`> 30`). Nama kolom mengandung karakter spasi sehingga nama kolom tersebut perlu diapit menggunakan karakter backtick (`) agar tidak terjadi error.

In [12]:
df.query('`kolom dua` > 30')

   kolom_satu  kolom dua
3           4         40
4           5         50